import math

print("Визначити різницю між результатами обчислень числа pi за допомогою ряду Грегорі та добутком Валіса:")

print("\nВведіть кількість ітерацій:")
n=int(input()) #кількість ітерацій

#Початкові значення:
k=0 #лічильник для циклів
gregory=0 #число pi, обчислене за допомогою ряду Грегорі
wallis=1 #число pi, обчислене за допомогою добутку Валіса

#Цикл знаходження числа pi за допомогою ряду Грегорі:
for k in range(0, n):
 gregory=gregory+(((-1)**(k))/(2*k+1))
 k+=1
gregory=gregory*4

k=0 #обнуляємо лічильник

s=2 #чисельник дробу, на який в циклі множимо значення wallis
g=1 #знаменник дробу, на який в циклі множимо значення wallis

#Цикл знаходження числа pi за допомогою добутку Валіса:
for k in range(0, n):
 l=k%2
 wallis=wallis*(s/g)
 if l==0:
  g+=2
 else:
  s+=2
 k+=1
wallis=wallis*2

difference=gregory-wallis #шукана різниця

print("\nЗа рядом Грегорі: "+str(gregory))
print("За добутком Валіса: "+str(wallis))
print("\nРізниця: "+str(difference))


#Порівняння одержаних результатів з точним значенням числа pi:
if gregory>math.pi:
 print("\nУ ході обчислення за допомогою ряду Грегорі отримане число, яке є БІЛЬШИМ за число pi")
else:
 print("\nУ ході обчислення за допомогою ряду Грегорі отримане число, яке є МЕНШИМ за число pi")
 
if wallis>math.pi:
 print("У ході обчислення за допомогою добутку Валіса отримане число, яке є БІЛЬШИМ за число pi")
else:
 print("У ході обчислення за допомогою добутку Валіса отримане число, яке є МЕНШИМ за число pi")
