#виведення тексту на екран:
print("Розрахунок n-ного члена геометричної прогресії")
print("Зауважте, що n має бути натуральним числом\n") 

#задання необхідних змінних числовими значеннями, які вводить користувач:
print("Введіть значення першого члена прогресії (b):")
b=float(input()) 
print("А зараз введіть значення знаменника прогресії (q):")
q=float(input()) 
print("Також нам знадобиться порядковий номер шуканого члена прогресії (n):") 
n=int(input()) 

#розрахунки:
j=n-1 
k=q**j 
answer=b*k 

#виведення тексту на екран:
print ("n-ний член дорівнює")
print (answer) 
print ("\nНатисніть enter для завершення програми")

#useless - змінна, ввід значення якої доданий лише для того, щоб термінал не закривався одразу після завершення операції знаходження n-ного члена геометричної прогресії. Після будь-якого введення та/або натиснення enter програма завершить роботу.
useless=input()
