#include <stdio.h>
#include <math.h>
#include <iostream>
using namespace std;

int main()
{
    // Введення необхідних змінних
    float x, y, distance;

    cout << "24 варіант. Визначити, чи належить точка з координатами (x, y) заштрихованій частині площини\n";

    // Отримання необхідних даних
    cout << "Введіть значення x:";
    cin >> x;
    cout << "Введіть значення y:";
    cin >> y;

    // Перевірка виконання необхідних умов і вивід результату на екран
    if (x >= -1) {
        cout << "\nТочка належить заштрихованій частині площини";
    }
    else {
        distance = pow((pow((x + 2), 2) + pow(y, 2)), 0.5);
        if (1 <= distance && distance <= 2) {
            cout << "\nТочка належить заштрихованій частині площини";
        }
        else {
            cout << "\nТочка не належить заштрихованій частині площини";
        }
    }
}