print("24 варіант. Визначити, чи належить точка з координатами (x, y) заштрихованій частині площини\n")

#задання необхідних змінних числовими значеннями, які вводить користувач:
print("Введіть значення x:")
x=float(input())
print("Введіть значення y:")
y=float(input())

#перевірка необхідних умов і вивід результату на екран
if x>=-1:
 print("\nТочка належить заштрихованій частині площини")
else:
 distance=((x+2)**2+y**2)**0.5
 if 1<= distance <=2:
  print("\nТочка належить заштрихованій частині площини")
 else:
  print("\nТочка не належить заштрихованій частині площини")

#useless - змінна, ввід значення якої доданий лише для того, щоб термінал не закривався одразу після завершення усіх вищеперечислених дій. Після натиснення enter програма завершить роботу.
print("\nНатисніть enter для завершення програми")
useless=input()

